<?php
/* ========================================================================== */
/* =   프로그램 명	:	CardAuthSugi.php                             		= */
/* =   프로그램 설명:	샘플  파일                     	= */
/* =   작성일		:	2014-09      		                    			= */
/* =   저작권		:	(주)다우기술                                		= */
/* ========================================================================== */
?>
<?php
/* ========================================================================== */
/* =   데이터 셋업 					                    					= */
/* ========================================================================== */
require "./library/Card_library.php";
require "./config/common_config.cfg";

/* ========================================================================== */
/* =   승인 요청 정보 설정                            			       		 = */
/* ========================================================================== */
/* = 	 NOT NULL	                           		                        = */
/* ========================================================================== */
	$CPID				= $_POST[ "CPID"	];
	$DAOUTRX			=$_POST[ "DAOUTRX" ];
	$CERTTYPE			= "09";						//고정값
	$CERTRESULTCODE	    = "0000";					//고정값
	$CERTRESULTMSG	    = "정상처리 되었습니다."; 	//고정값
	$USEREMAIL		    =$_POST[ "USEREMAIL" ];
	$USERMOBILENO		=$_POST[ "USERMOBILENO" ];
	$AMOUNT			    =$_POST[ "AMOUNT" ];
	$QUOTA			    =$_POST[ "QUOTA" ];
	$NOINTFLAG		    =$_POST[ "NOINTFLAG" ];
	$ENCDATA1			=$_POST[ "ENCDATA1" ];
	$ENCDATA2			=$_POST[ "ENCDATA2" ];
	$ENCDATA3			=$_POST[ "ENCDATA3" ];
	$ENCDATA4			=$_POST[ "ENCDATA4" ];
	
/* ========================================================================== */
/* = 	 결제승인 요청				     	                    = */
/* ========================================================================== */
	CardAuthSugi(  SERVER_IP, CARD_PORT, $CPID, ENCKEY, TIMEOUT );

/* ========================================================================== */
/* =  결과코드 0000 : 성공	그외 : 실패				    = */
/* ========================================================================== */
if( $res_resultcode == "0000" ) {
?>
	<script language="javascript">
		alert("결제성공");
		</script>
<?php
} else {
?>
	<script language="javascript">
		alert("결제실패");
		</script>
<?php
}
?>