<?php
/* ========================================================================== */
/* =   프로그램 명	:	CardOrderSugi.php                             		= */
/* =   프로그램 설명:	Card 배치키 요청 샘플  파일                     	= */
/* =   작성일		:	2014-09      		                    			= */
/* =   저작권		:	(주)다우기술                                		= */
/* ========================================================================== */
?>
<?php
/* ========================================================================== */
/* =   데이터 셋업 					                    					= */
/* ========================================================================== */
require "./library/Card_library.php";
require "./config/common_config.cfg";

	$CARDBINNO			= $_POST["CARDNO"];
	$CPID				= $_POST[ "CPID"	];
	CardBinchk( SERVER_IP, CARD_PORT, $CPID, ENCKEY, TIMEOUT );
	

/* ========================================================================== */
/* =  카드BIN체크 결과코드 0000 : 성공	그외 : 실패				    = */
/* ========================================================================== */

if( $res_resultcode == "0000" ) {	
		/* ========================================================================== */
		/* =   요청 정보 설정                            			       		    = */
		/* ========================================================================== */
		/* = 	 NOT NULL	                           		                        = */
		/* ========================================================================== */
			$CPID				= $_POST[ "CPID"	];
			$ORDERNO			= $_POST[ "ORDERNO"	];		
			$PRODUCTTYPE		= $_POST[ "PRODUCTTYPE"	];	
			$BILLTYPE			= $_POST[ "BILLTYPE"	];
			$CARDCD				= $res_cardcd;
			$TAXFREECD			= $_POST[ "TAXFREECD"	];
			$QUOTA				= $_POST[ "QUOTA"	];
			$AMOUNT				= $_POST[ "AMOUNT"	];
			$IPADDRESS			= $_POST[ "IPADDRESS"	];
			
		/* ========================================================================== */
		/* =   요청 정보 설정                            			       		    = */
		/* ========================================================================== */
		/* = 	 NULL 허용                	           		                        = */ 
		/* ========================================================================== */
			$USERID				= $_POST[ "USERID"	];
			$USERNAME			= $_POST[ "USERNAME"	];
			$PRODUCTCODE		= $_POST[ "PRODUCTCODE"	];
			$PRODUCTNAME		= $_POST[ "PRODUCTNAME"	];
			$RESERVEDINDEX1		= $_POST[ "RESERVEDINDEX1"	];
			$RESERVEDINDEX2		= $_POST[ "RESERVEDINDEX2"	];
			$RESERVEDSTRING		= $_POST[ "RESERVEDSTRING"	];
		/* ========================================================================== */
		/* = 	 결제인증 요청				     	                    = */
		/* ========================================================================== */
		CardOrderSugi( SERVER_IP, CARD_PORT, $CPID, ENCKEY, TIMEOUT );

		/* ========================================================================== */
		/* =  인증시도 결과코드 0000 : 성공	그외 : 실패				    = */
		/* ========================================================================== */		
		if( $res_resultcode == "0000" ) {
		?>
			<script language="javascript">
				alert("인증성공");
				</script>
		<?php
		} else {
		?>
			<script language="javascript">
				alert("인증실패");
				</script>
		<?php
		}
}
?>